Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
/*
 * Copyright 2013, Broadcom Corporation
 * All Rights Reserved.
 *
 * This is UNPUBLISHED PROPRIETARY SOURCE CODE of Broadcom Corporation;
 * the contents of this file may not be disclosed to third parties, copied
 * or duplicated in any form, in whole or in part, without the prior
 * written permission of Broadcom Corporation.
 */

/** @file
 *
 */
#include "stm32f2xx_platform.h"
#include "stm32f2xx_flash.h"
#include "wwd_constants.h"
#include "wwd_assert.h"
#include "platform.h"
#include "platform_common_config.h"
#include "wiced_platform.h"
#include "gpio_irq.h"
#include "watchdog.h"
#include "platform_dct.h"
#include <string.h> // For memcmp
#include "Platform/wwd_platform_interface.h"
#include "stm32f2xx_i2c.h"
#include "crt0.h"
#include "platform_sleep.h"
#include "rtc.h"
//////////////////////////////////////////////////////////////////////
// sekim 20131125 Add SPI Interface
#include "wiced_platform.h"
#include <stdio.h>
//////////////////////////////////////////////////////////////////////

#ifdef __GNUC__
#include "../../GCC/stdio_newlib.h"
#endif /* ifdef __GNUC__ */

#ifdef __GNUC__
#define WEAK __attribute__ ((weak))
#elif defined ( __IAR_SYSTEMS_ICC__ )
#define WEAK
#endif /* ifdef __GNUC__ */

#ifndef WICED_DISABLE_BOOTLOADER
#include "bootloader_app.h"
#endif

/******************************************************
 *                      Macros
 ******************************************************/

#ifndef WICED_DISABLE_MCU_POWERSAVE
#define MCU_CLOCKS_NEEDED()       stm32f2xx_clocks_needed()
#define MCU_CLOCKS_NOT_NEEDED()   stm32f2xx_clocks_not_needed()
#define MCU_RTC_INIT()            RTC_Wakeup_init()
#else
#define MCU_CLOCKS_NEEDED()
#define MCU_CLOCKS_NOT_NEEDED()
#ifdef WICED_ENABLE_MCU_RTC
#define MCU_RTC_INIT() platform_rtc_init()
#else /* #ifdef WICED_ENABLE_MCU_RTC */
#define MCU_RTC_INIT()
#endif /* #ifdef WICED_ENABLE_MCU_RTC */
#endif /* ifndef WICED_DISABLE_MCU_POWERSAVE */

/******************************************************
 *                    Constants
 ******************************************************/

#define MAX_NUM_SPI_PRESCALERS     (8)
#define SPI_DMA_TIMEOUT_LOOPS      (10000)

#if defined( PLATFORM_STM32_VOLTAGE_1V8_TO_2V1 )
#define ERASE_VOLTAGE_RANGE ( VoltageRange_1 )
#define FLASH_WRITE_FUNC    ( FLASH_ProgramByte )
#define FLASH_WRITE_SIZE    ( 1 )
typedef uint8_t flash_write_t;
#elif defined( PLATFORM_STM32_VOLTAGE_2V1_TO_2V7 )
#define ERASE_VOLTAGE_RANGE ( VoltageRange_2 )
#define FLASH_WRITE_FUNC    ( FLASH_ProgramHalfWord )
#define FLASH_WRITE_SIZE    ( 2 )
typedef uint16_t flash_write_t;
#elif defined( PLATFORM_STM32_VOLTAGE_2V7_TO_3V6 )
#define ERASE_VOLTAGE_RANGE ( VoltageRange_3 )
#define FLASH_WRITE_FUNC    ( FLASH_ProgramWord )
#define FLASH_WRITE_SIZE    ( 4 )
typedef uint32_t flash_write_t;
#elif defined( PLATFORM_STM32_VOLTAGE_2V7_TO_3V6_EXTERNAL_VPP )
#define ERASE_VOLTAGE_RANGE ( VoltageRange_4 )
#define FLASH_WRITE_FUNC    ( FLASH_ProgramDoubleWord )
#define FLASH_WRITE_SIZE    ( 8 )
typedef uint64_t flash_write_t;
#else
/* No Voltage range defined for platform */
/* You need to define one of:
 *   PLATFORM_STM32_VOLTAGE_1V8_TO_2V1
 *   PLATFORM_STM32_VOLTAGE_2V1_TO_2V7
 *   PLATFORM_STM32_VOLTAGE_2V7_TO_3V6
 *   PLATFORM_STM32_VOLTAGE_2V7_TO_3V6_EXTERNAL_VPP
 */
#error Platform Voltage Range not defined
#endif

#define APP_HDR_START_ADDR   ((uint32_t)&app_hdr_start_addr_loc)
#define DCT1_START_ADDR  ((uint32_t)&dct1_start_addr_loc)
#define DCT1_SIZE        ((uint32_t)&dct1_size_loc)
#define DCT2_START_ADDR  ((uint32_t)&dct2_start_addr_loc)
#define DCT2_SIZE        ((uint32_t)&dct2_size_loc)
#define SRAM_START_ADDR  ((uint32_t)&sram_start_addr_loc)
#define SRAM_SIZE        ((uint32_t)&sram_size_loc)

#if 0 //MikeJ
#define PLATFORM_DCT_COPY1_START_SECTOR      ( FLASH_Sector_1  )
#define PLATFORM_DCT_COPY1_START_ADDRESS     ( DCT1_START_ADDR )
#define PLATFORM_DCT_COPY1_END_SECTOR        ( FLASH_Sector_1 )
#define PLATFORM_DCT_COPY1_END_ADDRESS       ( DCT1_START_ADDR + DCT1_SIZE )
#define PLATFORM_DCT_COPY2_START_SECTOR      ( FLASH_Sector_2  )
#define PLATFORM_DCT_COPY2_START_ADDRESS     ( DCT2_START_ADDR )
#define PLATFORM_DCT_COPY2_END_SECTOR        ( FLASH_Sector_2 )
#define PLATFORM_DCT_COPY2_END_ADDRESS       ( DCT1_START_ADDR + DCT1_SIZE )
#else
#define PLATFORM_DCT_COPY1_START_SECTOR      ( FLASH_Sector_2  )
#define PLATFORM_DCT_COPY1_START_ADDRESS     ( DCT1_START_ADDR )
#define PLATFORM_DCT_COPY1_END_SECTOR        ( FLASH_Sector_2 )
#define PLATFORM_DCT_COPY1_END_ADDRESS       ( DCT1_START_ADDR + DCT1_SIZE )
#define PLATFORM_DCT_COPY2_START_SECTOR      ( FLASH_Sector_3  )
#define PLATFORM_DCT_COPY2_START_ADDRESS     ( DCT2_START_ADDR )
#define PLATFORM_DCT_COPY2_END_SECTOR        ( FLASH_Sector_3 )
#define PLATFORM_DCT_COPY2_END_ADDRESS       ( DCT1_START_ADDR + DCT1_SIZE )
#endif

#define ERASE_DCT_1()              platform_erase_flash(PLATFORM_DCT_COPY1_START_SECTOR, PLATFORM_DCT_COPY1_END_SECTOR)
#define ERASE_DCT_2()              platform_erase_flash(PLATFORM_DCT_COPY2_START_SECTOR, PLATFORM_DCT_COPY2_END_SECTOR)

#ifndef STDIO_BUFFER_SIZE
#ifndef BUILD_WIZFI250 //MikeJ 130528 ID1072 - Improve UART speed (AT+SSEND)
#define STDIO_BUFFER_SIZE   64
#else
#define STDIO_TX_BUFFER_SIZE   512
#define STDIO_RX_BUFFER_SIZE   2048
#endif
#endif

#define I2C_FLAG_CHECK_TIMEOUT      ( 1000 )
#define I2C_FLAG_CHECK_LONG_TIMEOUT ( 1000 )


#define I2C_MESSAGE_DMA_MASK_POSN 0
#define I2C_MESSAGE_NO_DMA    (0 << I2C_MESSAGE_DMA_MASK_POSN) /* No DMA is set to 0 because DMA should be enabled by */
#define I2C_MESSAGE_USE_DMA   (1 << I2C_MESSAGE_DMA_MASK_POSN) /* default, and turned off as an exception */

wiced_result_t wiced_i2c_init_tx_message(wiced_i2c_message_t* message, const void* tx_buffer, uint16_t  bufffer_length, uint16_t retries , wiced_bool_t disable_dma);
wiced_result_t wiced_i2c_init_rx_message(wiced_i2c_message_t* message, void* rx_buffer, uint16_t  bufffer_length, uint16_t retries , wiced_bool_t disable_dma);
wiced_result_t wiced_i2c_init_combined_message(wiced_i2c_message_t* message, const void* tx_buffer, void* rx_buffer, uint16_t tx_buffer_length, uint16_t rx_buffer_length, uint16_t retries , wiced_bool_t disable_dma);

#ifdef BUILD_WIZFI250 // sekim 20131125 Add SPI Interface
#define SPI_RX_XON_POINT			( 128 )
#define SPI_RX_XOFF_POINT			( 32 )
#define SPI_NULL	(uint8_t) 0xF0
#define SPI_ESC		(uint8_t) 0xF1
#define SPI_F0		(uint8_t) 0x00
#define SPI_F1		(uint8_t) 0x01
#define SPI_SYNC	(uint8_t) 0x02
#define SPI_XON		(uint8_t) 0x03
#define SPI_XOFF	(uint8_t) 0x04
#define SPI_ERR		(uint8_t) 0x05
// sekim XXXXXXX
#define DMA_BURST_SIZE	1024	// 2013.12.18 sskim
#define DMA_BUFFER_SIZE	5		// 2014.01.06 sskim
#endif

#define DMA_FLAG_TC(stream_id) dma_flag_tc(stream_id)
#define DMA_TIMEOUT_LOOPS      (10000000)

#define NUMBER_OF_LSE_TICKS_PER_MILLISECOND(scale_factor) ( 32768 / 1000 / scale_factor )
#define CONVERT_FROM_TICKS_TO_MS(n,s) ( n / NUMBER_OF_LSE_TICKS_PER_MILLISECOND(s) )
#define CK_SPRE_CLOCK_SOURCE_SELECTED 0xFFFF

/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

typedef struct
{
    uint32_t               rx_size;
    wiced_ring_buffer_t*   rx_buffer;
    host_semaphore_type_t  rx_complete;
    host_semaphore_type_t  tx_complete;
} uart_interface_t;

typedef struct
{
    uint16_t factor;
    uint16_t prescaler_value;
} spi_baudrate_division_mapping_t;

// sekim XXXXXXX
#ifdef BUILD_WIZFI250 	// 2014.01.07 sskim
typedef struct {
	uint8_t		buf[DMA_BUFFER_SIZE][DMA_BURST_SIZE];
	uint32_t	buf_len[DMA_BUFFER_SIZE];
	uint32_t	push;
	uint32_t	pop;
	uint32_t	len;

	/* For Debugging */
	uint32_t	overflow;
	uint32_t	underflow;
} SPI_DMA_BUFFER;
#endif					// 2014.01.07 sskim

/******************************************************
 *               Function Declarations
 ******************************************************/

static wiced_result_t wiced_spi_configure_baudrate( uint32_t speed, uint16_t* prescaler );
static wiced_result_t spi_dma_transfer            ( const wiced_spi_device_t* spi );
static void           spi_dma_config              ( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* message );

static wiced_result_t platform_uart_init ( wiced_uart_t uart, const wiced_uart_config_t* config, wiced_ring_buffer_t* optional_rx_buffer );
static wiced_result_t platform_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout );

#ifndef WICED_DISABLE_MCU_POWERSAVE
void stm32f2xx_clocks_needed    ( void );
void stm32f2xx_clocks_not_needed( void );
static void RTC_Wakeup_init( void );
#endif

#if defined(WICED_ENABLE_MCU_RTC) && defined(WICED_DISABLE_MCU_POWERSAVE)
void platform_rtc_init( void );
#endif /* #if defined(WICED_ENABLE_MCU_RTC) && defined(WICED_DISABLE_MCU_POWERSAVE) */
void wake_up_interrupt_notify( void );

/* Interrupt service functions - called from interrupt vector table */
void RTC_WKUP_irq     ( void );
void usart2_rx_dma_irq( void );
void usart1_rx_dma_irq( void );
void usart6_rx_dma_irq( void );
void usart2_tx_dma_irq( void );
void usart1_tx_dma_irq( void );
void usart6_tx_dma_irq( void );
void usart2_irq       ( void );
void usart1_irq       ( void );
void usart6_irq       ( void );
// sekim 20131125 Add SPI Interface
void spi1_irq          ( void );

////////////////////////////////////////////////////////
// sekim XXXXXXXXXXXX
// 2013.12.05 sskim
void spi1_rx_dma_irq	(void);
void spi1_tx_dma_irq	(void);

