Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
    /* Init and enable SPI */
    SPI_Init( spi_mapping[spi->port].spi_regs, &spi_init );
    SPI_Cmd ( spi_mapping[spi->port].spi_regs, ENABLE );

#ifdef BUILD_WIZFI250 	// 2013.12.05 sskim
    if ( g_wxProfile_mext1_1==11 ) // sekim XXXXXX
    {
		{
			wiced_spi_message_segment_t segment;
			
			init_spi_dma_buffer(&spi_rx_dma_buffer);											// 2014.01.07 sskim
			segment.tx_buffer = NULL;
			segment.length = DMA_BURST_SIZE;
			segment.rx_buffer = (void *)spi_rx_dma_buffer.buf[spi_rx_dma_buffer.push];			// 2014.01.07 sskim

			spi_dma_config(spi, &segment);
		}
		/* 2013.12.31 sskim dma initial */
		{
			/* Configure RX DMA interrupt on Cortex-M3 */
			NVIC_InitTypeDef  nvic_init_structure;
			nvic_init_structure.NVIC_IRQChannel                   = DMA2_Stream0_IRQn;
			nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0x4;
			nvic_init_structure.NVIC_IRQChannelSubPriority        = 0x5;
			nvic_init_structure.NVIC_IRQChannelCmd                = ENABLE;
			NVIC_Init( &nvic_init_structure );

			/* Enable TC (transfer complete) and TE (transfer error) interrupts on source */
			DMA_ITConfig(spi_mapping[spi->port].rx_dma_stream, DMA_IT_TC | DMA_IT_TE, ENABLE);

			DMA_Cmd(spi_mapping[spi->port].rx_dma_stream, ENABLE);
		}
    }
#endif	// 2013.12.05 sskim

    MCU_CLOCKS_NOT_NEEDED();

    current_spi_device = (wiced_spi_device_t*)spi;

    return WICED_SUCCESS;
}

wiced_result_t wiced_spi_transfer( const wiced_spi_device_t* spi, wiced_spi_message_segment_t* segments, uint16_t number_of_segments )
{
    wiced_result_t result = WICED_SUCCESS;
    uint16_t       i;
    uint32_t       count = 0;

    wiced_assert("Bad args", (spi != NULL) && (segments != NULL) && (number_of_segments != 0));

    MCU_CLOCKS_NEEDED();

    /* If the given SPI device is not the current SPI device, initialise */
    if ( spi != current_spi_device )
    {
        wiced_spi_init( spi );
    }

    /* Activate chip select */
    wiced_gpio_output_low(spi->chip_select);

    for ( i = 0; i < number_of_segments; i++ )
    {
        /* Check if we are using DMA */
        if ( spi->mode & SPI_USE_DMA )
        {
            spi_dma_config( spi, &segments[i] );
            result = spi_dma_transfer( spi );
            if ( result != WICED_SUCCESS )
            {
                goto cleanup_transfer;
            }
        }
        else
        {
            /* in interrupt-less mode */
            if ( spi->bits == 8 )
            {
                const uint8_t* send_ptr = ( const uint8_t* )segments[i].tx_buffer;
                uint8_t*       rcv_ptr  = ( uint8_t* )segments[i].rx_buffer;
                count = segments[i].length;
                while ( count-- )
                {
                    uint16_t data;
                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr;
                        send_ptr++;
                    }
                    else
                    {
                        data = 0xFF;
                    }

                    /* Wait until the transmit buffer is empty */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE ) == RESET )
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData( spi_mapping[spi->port].spi_regs, data );

                    /* Wait until a data is received */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE ) == RESET )
                    {}

                    /* Get the received data */
                    data = SPI_I2S_ReceiveData( spi_mapping[spi->port].spi_regs );

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = (uint8_t)data;
                    }
                }
            }
            else if ( spi->bits == 16 )
            {
                const uint16_t* send_ptr = (const uint16_t *) segments[i].tx_buffer;
                uint16_t*       rcv_ptr  = (uint16_t *) segments[i].rx_buffer;

                /* Check that the message length is a multiple of 2 */
                if ( ( count % 2 ) == 0 )
                {
                    result = WICED_ERROR;
                    goto cleanup_transfer;
                }

                while ( count != 0)
                {
                    uint16_t data = 0xFFFF;
                    count -= 2;

                    if ( send_ptr != NULL )
                    {
                        data = *send_ptr++;
                    }

                    /* Wait until the transmit buffer is empty */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_TXE ) == RESET )
                    {}

                    /* Send the byte */
                    SPI_I2S_SendData( spi_mapping[spi->port].spi_regs, data );

                    /* Wait until a data is received */
                    while ( SPI_I2S_GetFlagStatus( spi_mapping[spi->port].spi_regs, SPI_I2S_FLAG_RXNE ) == RESET )
                    {}

                    /* Get the received data */
                    data = SPI_I2S_ReceiveData( spi_mapping[spi->port].spi_regs );

                    if ( rcv_ptr != NULL )
                    {
                        *rcv_ptr++ = data;
                    }
                }
            }
        }
    }
cleanup_transfer:
    wiced_gpio_output_high(spi->chip_select);

    MCU_CLOCKS_NOT_NEEDED();

    return result;
}

wiced_result_t wiced_spi_deinit( const wiced_spi_device_t* spi )
{
#ifndef BUILD_WIZFI250 // sekim 20131125 Add SPI Interface
    GPIO_InitTypeDef gpio_init_structure;

    MCU_CLOCKS_NEEDED();

    /* De-init and disable SPI */
    SPI_Cmd( spi_mapping[ spi->port ].spi_regs, DISABLE );
    SPI_I2S_DeInit( spi_mapping[ spi->port ].spi_regs );

    /* Disable SPI peripheral clock */
    spi_mapping[spi->port].peripheral_clock_func( spi_mapping[spi->port].peripheral_clock_reg,  DISABLE );

