Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
    /* Reset all pins to input floating state */
    gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN;      // Input
    gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;  // Floating (No-pull)
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;     // Arbitrary. Only applicable for output
    gpio_init_structure.GPIO_Speed = GPIO_Speed_100MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_clock->number)) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_miso->number )) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_mosi->number ));

    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );

    /* Reset CS pin to input floating state */
    wiced_gpio_init( spi->chip_select, INPUT_HIGH_IMPEDANCE );

    if ( spi == current_spi_device )
    {
        current_spi_device = NULL;
    }

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
#else
	GPIO_InitTypeDef gpio_init_structure;
	NVIC_InitTypeDef  nvic_init_structure;

	while(ring_buffer_used_space(&stdio_tx_buffer) != 0)
		host_rtos_delay_milliseconds(1);
	host_rtos_delay_milliseconds(10);
	wiced_gpio_output_low( WIZFI_SPI_REQ );

	SPI_Cmd (spi_mapping[spi->port].spi_regs, DISABLE);

	gpio_init_structure.GPIO_Mode  = GPIO_Mode_IN;
	gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	gpio_init_structure.GPIO_OType = GPIO_OType_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_clock->number)) |
                                     ((uint32_t) (1 << spi_mapping[spi->port].pin_mosi->number )) |
                                     ((uint32_t) (1 << gpio_mapping[spi->chip_select].number  ));
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );
	gpio_init_structure.GPIO_Mode  = GPIO_Mode_OUT;
	gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	gpio_init_structure.GPIO_OType = GPIO_OType_PP;
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;
    gpio_init_structure.GPIO_Pin   = ((uint32_t) (1 << spi_mapping[spi->port].pin_miso->number ));
    GPIO_Init( spi_mapping[spi->port].pin_clock->bank, &gpio_init_structure );
	wiced_gpio_output_low(WIZFI_SPI_MISO);

    nvic_init_structure.NVIC_IRQChannel                   = SPI1_IRQn;
    nvic_init_structure.NVIC_IRQChannelPreemptionPriority = (uint8_t) 0xf;
    nvic_init_structure.NVIC_IRQChannelSubPriority        = 0xf;
    nvic_init_structure.NVIC_IRQChannelCmd                = DISABLE;
    NVIC_Init( &nvic_init_structure );

	SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_TXE, DISABLE);
	SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, DISABLE);

	spi_mapping[spi->port].peripheral_clock_func( spi_mapping[spi->port].peripheral_clock_reg,  DISABLE );

    return WICED_SUCCESS;
#endif
}

#ifdef BUILD_WIZFI250	// kaizen 20131126 ID1151 XON Signal
wiced_result_t wiced_check_spi_rx_status(void);
wiced_result_t wiced_check_spi_rx_status(void)
{
	uint32_t free_len;

	if(platfrom_spi_stdio_x == 2 && spi_rx_suspend == CTRL_REQ)
	{
		free_len = ring_buffer_free_space(&stdio_rx_buffer);

		if(free_len > SPI_RX_XON_POINT)
		{
			spi_rx_suspend = CTRL_NON;
			spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
			wiced_gpio_output_high( WIZFI_SPI_REQ );
		}
	}

    return WICED_SUCCESS;
}
#endif


wiced_result_t wiced_i2c_init( wiced_i2c_device_t* device  )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    I2C_InitTypeDef  I2C_InitStructure;

    wiced_assert( "bad argument", device != NULL );

    MCU_CLOCKS_NEEDED();

    // Init I2C GPIO clocks
    RCC_APB1PeriphClockCmd( i2c_mapping[device->port].peripheral_clock_reg, ENABLE );
    RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].pin_scl->peripheral_clock | i2c_mapping[device->port].pin_sda->peripheral_clock, ENABLE );
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );

    // Reset the I2C clock
    RCC_APB1PeriphResetCmd( i2c_mapping[device->port].peripheral_clock_reg, ENABLE );
    RCC_APB1PeriphResetCmd( i2c_mapping[device->port].peripheral_clock_reg, DISABLE );

    // GPIO Configuration
    GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
    GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

    GPIO_InitStructure.GPIO_Pin = (uint32_t)( 1 << i2c_mapping[device->port].pin_scl->number );
    GPIO_Init( i2c_mapping[device->port].pin_scl->bank, &GPIO_InitStructure );
    GPIO_InitStructure.GPIO_Pin = (uint32_t)( 1 << i2c_mapping[device->port].pin_sda->number );
    GPIO_Init( i2c_mapping[device->port].pin_sda->bank, &GPIO_InitStructure );

    // Configure SDA and SCL as I2C pins
    GPIO_PinAFConfig( i2c_mapping[device->port].pin_scl->bank, (uint16_t)i2c_mapping[device->port].pin_scl->number, (uint8_t)i2c_mapping[device->port].gpio_af );
    GPIO_PinAFConfig( i2c_mapping[device->port].pin_sda->bank, (uint16_t)i2c_mapping[device->port].pin_sda->number, (uint8_t)i2c_mapping[device->port].gpio_af );

    if ( device->flags & I2C_DEVICE_USE_DMA )
    {
        // Enable the DMA clock
        RCC_AHB1PeriphClockCmd( i2c_mapping[device->port].tx_dma_peripheral_clock, ENABLE );

        // Configure the DMA streams for operation with the CP
        i2c_dma_init.DMA_Channel            = i2c_mapping[device->port].tx_dma_channel;
        i2c_dma_init.DMA_PeripheralBaseAddr = (uint32_t)&i2c_mapping[device->port].i2c->DR;
        i2c_dma_init.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
        i2c_dma_init.DMA_MemoryInc          = DMA_MemoryInc_Enable;
        i2c_dma_init.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        i2c_dma_init.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
        i2c_dma_init.DMA_Mode               = DMA_Mode_Normal;
        i2c_dma_init.DMA_Priority           = DMA_Priority_VeryHigh;
        //dma_init.DMA_FIFOMode           = DMA_FIFOMode_Enable;
        //dma_init.DMA_FIFOThreshold      = DMA_FIFOThreshold_Full;
        i2c_dma_init.DMA_MemoryBurst        = DMA_MemoryBurst_Single;
        i2c_dma_init.DMA_PeripheralBurst    = DMA_PeripheralBurst_Single;
        i2c_dma_init.DMA_Memory0BaseAddr    = (uint32_t) 0;               // This parameter will be configured during communication
        i2c_dma_init.DMA_DIR                = DMA_DIR_MemoryToPeripheral; // This parameter will be configured during communication
        i2c_dma_init.DMA_BufferSize         = 0xFFFF;                     // This parameter will be configured during communication

