Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
        /* Configure CTS Pin */
        gpio_init_structure.GPIO_Pin   = (uint32_t) ( 1 << uart_mapping[uart].pin_cts->number );
        gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF;
        gpio_init_structure.GPIO_OType = GPIO_OType_OD;
        gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
        GPIO_Init( uart_mapping[uart].pin_cts->bank, &gpio_init_structure );
        GPIO_PinAFConfig( uart_mapping[uart].pin_cts->bank, uart_mapping[uart].pin_cts->number, uart_mapping[uart].gpio_af );
#if 0	// kaizen 20130514 - For using USART Hardware Flow Control
    }
#endif

#if 0	// kaizen 20130514 - For using USART Hardware Flow Control
    if ( uart_mapping[uart].pin_cts && (config->flow_control == FLOW_CONTROL_RTS || config->flow_control == FLOW_CONTROL_CTS_RTS) )
    {
#endif
        /* Enable peripheral clock */
        RCC_AHB1PeriphClockCmd( uart_mapping[uart].pin_rts->peripheral_clock, ENABLE );

        /* Configure RTS Pin */
        gpio_init_structure.GPIO_Pin   = (uint32_t) ( 1 << uart_mapping[uart].pin_rts->number );
#ifndef BUILD_WIZFI250 //MikeJ 130507 ID1063 - USART HW Flow Control problem
        gpio_init_structure.GPIO_Mode  = GPIO_Mode_AF;
        gpio_init_structure.GPIO_OType = GPIO_OType_OD;
        gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
        GPIO_Init( uart_mapping[uart].pin_rts->bank, &gpio_init_structure );
        GPIO_PinAFConfig( uart_mapping[uart].pin_rts->bank, uart_mapping[uart].pin_rts->number, uart_mapping[uart].gpio_af );
#else
        gpio_init_structure.GPIO_Mode  = GPIO_Mode_OUT;
        gpio_init_structure.GPIO_OType = GPIO_OType_PP;
        gpio_init_structure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
        GPIO_Init( uart_mapping[uart].pin_rts->bank, &gpio_init_structure );
		GPIO_WriteBit(uart_mapping[uart].pin_rts->bank, (uint16_t) (1 << uart_mapping[uart].pin_rts->number), Bit_RESET);
#endif
#if 0	// kaizen 20130514 - For using USART Hardware Flow Control
    }
#endif

    /* Enable UART peripheral clock */
    uart_mapping[uart].usart_peripheral_clock_func( uart_mapping[uart].usart_peripheral_clock, ENABLE );

    /**************************************************************************
     * Initialise STM32 USART registers
     * NOTE:
     * - Both transmitter and receiver are disabled until usart_enable_transmitter/receiver is called.
     * - Only 1 and 2 stop bits are implemented at the moment.
     **************************************************************************/
    usart_init_structure.USART_Mode       = 0;
    usart_init_structure.USART_BaudRate   = config->baud_rate;
    usart_init_structure.USART_WordLength = ( ( config->data_width == DATA_WIDTH_9BIT ) ||
                                              ( ( config->data_width == DATA_WIDTH_8BIT ) && ( config->parity != NO_PARITY ) ) ) ? USART_WordLength_9b : USART_WordLength_8b;
    usart_init_structure.USART_StopBits   = ( config->stop_bits == STOP_BITS_1 ) ? USART_StopBits_1 : USART_StopBits_2;

    switch ( config->parity )
    {
        case NO_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_No;
            break;
        case EVEN_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_Even;
            break;
        case ODD_PARITY:
            usart_init_structure.USART_Parity = USART_Parity_Odd;
            break;
        default:
            return WICED_BADARG;
    }

    switch ( config->flow_control )
    {
        case FLOW_CONTROL_DISABLED:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        case FLOW_CONTROL_CTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        case FLOW_CONTROL_RTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        case FLOW_CONTROL_CTS_RTS:
            usart_init_structure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        default:
            return WICED_BADARG;
    }

    /* Initialise USART peripheral */
    USART_Init( uart_mapping[uart].usart, &usart_init_structure );


    /**************************************************************************
     * Initialise STM32 DMA registers
     * Note: If DMA is used, USART interrupt isn't enabled.
     **************************************************************************/
    /* Enable DMA peripheral clock */
    uart_mapping[uart].tx_dma_peripheral_clock_func( uart_mapping[uart].tx_dma_peripheral_clock, ENABLE );

    /* Fill init structure with common DMA settings */
    dma_init_structure.DMA_PeripheralInc   = DMA_PeripheralInc_Disable;
    dma_init_structure.DMA_MemoryInc       = DMA_MemoryInc_Enable;
    dma_init_structure.DMA_Priority        = DMA_Priority_VeryHigh;
    dma_init_structure.DMA_FIFOMode        = DMA_FIFOMode_Disable;
    dma_init_structure.DMA_FIFOThreshold   = DMA_FIFOThreshold_Full;
    dma_init_structure.DMA_MemoryBurst     = DMA_MemoryBurst_Single;
    dma_init_structure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;

    if ( config->data_width == DATA_WIDTH_9BIT )
    {
        dma_init_structure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        dma_init_structure.DMA_MemoryDataSize     = DMA_MemoryDataSize_HalfWord;
    }
    else
    {
        dma_init_structure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        dma_init_structure.DMA_MemoryDataSize     = DMA_MemoryDataSize_Byte;
    }

    /* Initialise TX DMA */
    DMA_DeInit( uart_mapping[uart].tx_dma_stream );
    dma_init_structure.DMA_Channel            = uart_mapping[uart].tx_dma_channel;
    dma_init_structure.DMA_PeripheralBaseAddr = (uint32_t) &uart_mapping[uart].usart->DR;
    dma_init_structure.DMA_Memory0BaseAddr    = (uint32_t) 0;
    dma_init_structure.DMA_DIR                = DMA_DIR_MemoryToPeripheral;
    dma_init_structure.DMA_BufferSize         = 0;
    dma_init_structure.DMA_Mode               = DMA_Mode_Normal;
    DMA_Init( uart_mapping[uart].tx_dma_stream, &dma_init_structure );

