Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
    uart_mapping[uart].tx_dma_stream->NDTR = size;
    uart_mapping[uart].tx_dma_stream->M0AR = (uint32_t)data;
    uart_mapping[uart].tx_dma_stream->CR  |= DMA_SxCR_EN;

    host_rtos_get_semaphore( &uart_interfaces[uart].tx_complete, WICED_NEVER_TIMEOUT, WICED_TRUE );
    while( ( uart_mapping[uart].usart->SR & USART_SR_TC )== 0 );

    MCU_CLOCKS_NOT_NEEDED();

    return WICED_SUCCESS;
}

// sekim 20131125 Add SPI Interface
char szXXXX2[1024] = {0,};
char szXXXX3[512] = {0,};

wiced_result_t wiced_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    if (uart_interfaces[uart].rx_buffer != NULL)
    {
#ifdef BUILD_WIZFI250 //MikeJ 130528 ID1072 - Improve UART Performance
		if(GPIO_ReadOutputDataBit(uart_mapping[uart].pin_rts->bank,
		(uint16_t) (1 << uart_mapping[uart].pin_rts->number))==Bit_SET
		&& ring_buffer_free_space(uart_interfaces[uart].rx_buffer)>30) {
			GPIO_WriteBit(uart_mapping[uart].pin_rts->bank,
			 (uint16_t) (1 << uart_mapping[uart].pin_rts->number), Bit_RESET);	//GPIO_WriteBit(GPIOC, GPIO_Pin_1, Bit_RESET);
		}
#endif
        while (size != 0)
        {
            uint32_t transfer_size = MIN(uart_interfaces[uart].rx_buffer->size / 2, size);

            /* Check if ring buffer already contains the required amount of data. */
            if ( transfer_size > ring_buffer_used_space( uart_interfaces[uart].rx_buffer ) )
            {
                /* Set rx_size and wait in rx_complete semaphore until data reaches rx_size or timeout occurs */
                uart_interfaces[uart].rx_size = transfer_size;

                if ( host_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout, WICED_TRUE ) != WICED_SUCCESS )
                {
                    uart_interfaces[uart].rx_size = 0;
                    return WICED_TIMEOUT;
                }

                /* Reset rx_size to prevent semaphore being set while nothing waits for the data */
                uart_interfaces[uart].rx_size = 0;
            }

            // sekim 20131125 add platfrom_spi_stdio_x
#ifdef BUILD_WIZFI250
            if ( platfrom_spi_stdio_x!=platfrom_spi_stdio )
            {
           		void quick_change_sdtio_mode(uint8_t mode);
           		quick_change_sdtio_mode(platfrom_spi_stdio_x);
            }
#endif


            size -= transfer_size;

            // Grab data from the buffer
            do
            {
                uint8_t* available_data;
                uint32_t bytes_available;

                ring_buffer_get_data( uart_interfaces[uart].rx_buffer, &available_data, &bytes_available );
                bytes_available = MIN( bytes_available, transfer_size );
                memcpy( data, available_data, bytes_available );
                transfer_size -= bytes_available;
                data = ( (uint8_t*) data + bytes_available );
                ring_buffer_consume( uart_interfaces[uart].rx_buffer, bytes_available );
            } while ( transfer_size != 0 );
        }

        if ( size != 0 )
        {
            return WICED_ERROR;
        }
        else
        {
            return WICED_SUCCESS;
        }
    }
    else
    {
        return platform_uart_receive_bytes( uart, data, size, timeout );
    }
}

static wiced_result_t platform_uart_receive_bytes( wiced_uart_t uart, void* data, uint32_t size, uint32_t timeout )
{
    uint32_t tmpvar; /* needed to ensure ordering of volatile accesses */
    uint32_t shift = uart_mapping[uart].rx_dma_stream_number % 4;

    if ( uart_interfaces[uart].rx_buffer != NULL )
    {
        uart_mapping[uart].rx_dma_stream->CR |= DMA_SxCR_CIRC;

        // Enabled individual byte interrupts so progress can be updated
        USART_ITConfig( uart_mapping[uart].usart, USART_IT_RXNE, ENABLE );
    }
    else
    {
        uart_mapping[uart].rx_dma_stream->CR &= ~(uint32_t) DMA_SxCR_CIRC;
    }

    if ( uart_mapping[uart].rx_dma_stream_number > 3 )
    {
        tmpvar = uart_mapping[uart].rx_dma->HISR;
        uart_mapping[uart].rx_dma->HIFCR |= ( tmpvar & ( 0xffUL << shift ) );
    }
    else
    {
        tmpvar = uart_mapping[uart].rx_dma->LISR;
        uart_mapping[uart].rx_dma->LIFCR |= ( tmpvar & ( 0xffUL << shift ) );
    }

    uart_mapping[uart].rx_dma_stream->NDTR = size;
    uart_mapping[uart].rx_dma_stream->M0AR = (uint32_t)data;
    uart_mapping[uart].rx_dma_stream->CR  |= DMA_SxCR_EN;

    if ( timeout > 0 )
    {
        host_rtos_get_semaphore( &uart_interfaces[uart].rx_complete, timeout, WICED_TRUE );
    }

    return WICED_SUCCESS;
}

/******************************************************
 *                 DCT Functions
 ******************************************************/

#ifndef WICED_DISABLE_BOOTLOADER
platform_dct_data_t* platform_get_dct( void )
{
    platform_dct_header_t hdr =
    {
        .write_incomplete    = 0,
        .is_current_dct      = 1,
        .app_valid           = 1,
        .mfg_info_programmed = 0,
        .magic_number        = BOOTLOADER_MAGIC_NUMBER,
        .load_app_func       = NULL
    };

    platform_dct_header_t* dct1 = ((platform_dct_header_t*) PLATFORM_DCT_COPY1_START_ADDRESS);
    platform_dct_header_t* dct2 = ((platform_dct_header_t*) PLATFORM_DCT_COPY2_START_ADDRESS);

    if ( ( dct1->is_current_dct == 1 ) &&
         ( dct1->write_incomplete == 0 ) &&
         ( dct1->magic_number == BOOTLOADER_MAGIC_NUMBER ) )
    {
        return (platform_dct_data_t*)dct1;
    }

    if ( ( dct2->is_current_dct == 1 ) &&
         ( dct2->write_incomplete == 0 ) &&
         ( dct2->magic_number == BOOTLOADER_MAGIC_NUMBER ) )
    {
        return (platform_dct_data_t*)dct2;
    }

    /* No valid DCT! */
    /* Erase the first DCT and init it. */
    ERASE_DCT_1();
//    platform_bootloader_erase_dct( 1 );

    platform_write_flash_chunk( PLATFORM_DCT_COPY1_START_ADDRESS, (uint8_t*) &hdr, sizeof(hdr) );

    return (platform_dct_data_t*)dct1;
}

void platform_erase_dct( void )
{
    ERASE_DCT_1();
    ERASE_DCT_2();
}

/* TODO: Disable interrupts during function */
/* Note Function allocates a chunk of memory for the bootloader data on the stack - ensure the stack is big enough */
int platform_write_dct( uint16_t data_start_offset, const void* data, uint16_t data_length, int8_t app_valid, void (*func)(void) )
{
    platform_dct_header_t* new_dct;
    uint32_t               bytes_after_data;
    uint8_t*               new_app_data_addr;
    uint8_t*               curr_app_data_addr;
    platform_dct_header_t* curr_dct  = &platform_get_dct( )->dct_header;
    char                   zero_byte = 0;
    platform_dct_header_t  hdr =
    {
        .write_incomplete = 1,
        .is_current_dct   = 1,
        .magic_number     = BOOTLOADER_MAGIC_NUMBER
    };

    /* Check if the data is too big to write */
    if ( data_length + data_start_offset > ( PLATFORM_DCT_COPY1_END_ADDRESS - PLATFORM_DCT_COPY1_START_ADDRESS ) )
    {
        return -1;
    }

