Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
			spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
			if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
		}
		else if(ring_buffer_used_space(&stdio_tx_buffer) == 0 || spi_tx_suspend == CTRL_REQ)
		{
			SPI1->DR = SPI_NULL;
			// Deactivate Transmission Request through GPIO if it is Active
			if(spi_tx_sig_cnt > 0) {
				spi_tx_sig_cnt--;
				if(spi_tx_sig_cnt <= 0) wiced_gpio_output_low( WIZFI_SPI_REQ );
			}
		}
		else
		{
			static uint8_t *pch;
			static uint32_t tlen;
			static uint8_t esc = 0xFF;

			if(esc == 0xFF) {
				ring_buffer_get_data(&stdio_tx_buffer, &pch, &tlen);
				ring_buffer_consume(&stdio_tx_buffer, 1);
				if(*pch == 0xF0) {
					SPI1->DR = SPI_ESC;
					esc = SPI_F0;
				} else if(*pch == 0xF1) {
					SPI1->DR = SPI_ESC;
					esc = SPI_F1;
				} else {
					SPI1->DR = (uint16_t)*pch;
				}
			} else {
				SPI1->DR = esc;
				esc = 0xFF;
			}

			spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
			if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
		}
	}

//#if 0	// 2013.12.09 sskim
	if ( g_wxProfile_mext1_1!=11 ) // sekim XXXXXX
	{
			if(SPI_I2S_GetITStatus(SPI1, SPI_I2S_IT_RXNE) == SET)
			{
				uint8_t tch;
				uint32_t free_len;
				static uint8_t esc = RESET;
				static uint8_t sync[2] = {SPI_ESC, SPI_SYNC};

				tch = (uint8_t)SPI1->DR;

				if(tch == SPI_NULL) {
					return;
				}

				if(tch == SPI_ESC) {
					esc = SET;
					return;
				} else if(esc == SET) {
					esc = RESET;
					switch(tch) {
					case SPI_F0:	// Pass 'F0' to upper
						tch = 0xF0;
						break;
					case SPI_F1: // Pass 'F1' to upper
						tch = 0xF1;
						break;
					case SPI_SYNC: // Handle Sync Signal
						if(ring_buffer_free_space(&stdio_tx_buffer) >= 2)
							ring_buffer_write(&stdio_tx_buffer, sync, 2);
						//GPIO_ResetBits( GPIOB, (uint16_t) (1 << 6) );
						return;
					case SPI_XON: // Handle Xon Signal
						spi_tx_suspend = CTRL_NON;
						return;
					case SPI_XOFF: // Handle Xoff Signal
						spi_tx_suspend = CTRL_REQ;
						return;
					case SPI_ERR: // Handle Error Signal
						// ToDo
						return;
					case SPI_ESC: // Lost ESC Data
						esc = SET;	//Just Ignore previous ESC
						return;
					default:
						// ToDo
						return;
					}
					spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
					if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
				}

				free_len = ring_buffer_free_space(&stdio_rx_buffer);
				if(free_len <= SPI_RX_XON_POINT) {
					if(spi_rx_suspend == CTRL_NON) {	// 'IF' is needed for check that it is not in sending action (CTRL_RDY)
						spi_rx_suspend = CTRL_REQ;
						spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
						if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
					}
					if(free_len == 0) {
						GPIO_ResetBits( GPIOB, (uint16_t) (1 << 6) );
						goto SEM_CALC_END; //return;
					}
				}

				ring_buffer_write(&stdio_rx_buffer, &tch, 1);

		SEM_CALC_END:

				// sekim 20131125 add platfrom_spi_stdio_x
				platfrom_spi_stdio_x = 2;

				if((uart_interfaces[0].rx_size > 0) && (ring_buffer_used_space(&stdio_rx_buffer) >= uart_interfaces[0].rx_size))
				{
					host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
					uart_interfaces[0].rx_size = 0;
				}
			}
	}
//#endif	// 2013.12.09 sskim
#endif
}

#if 1	// 2013.12.05 sskim
#ifdef BUILD_WIZFI250	// 2013.12.09 sskim
uint32_t spi_rx_data_cnt = 0;
uint32_t spi_rx_drop_cnt = 0;
uint32_t spi_stdio_drop_cnt = 0;
uint32_t spi_tx_buffer_cnt = 0;
uint32_t spi_rx_buffer_cnt = 0;
uint32_t spi_int = 0;
uint32_t spi_thread_cnt = 0;
uint32_t ndtr = 0;

uint8_t tmp1_buf = ';';
uint8_t tmp2_buf = ';';
uint8_t cmp_char = 'A';	
uint32_t cmp_cnt = 0;
uint32_t spi_test_cnt = 0;
#endif	// BUILD_WIZFI250

void spi1_rx_dma_irq(void)
{
#ifdef BUILD_WIZFI250	// 2013.12.09 sskim

	if((DMA2->LISR & DMA_LISR_TCIF0) != 0)
	{
		DMA2->LIFCR |= DMA_LISR_TCIF0; 
	}

	if((DMA2->LISR & DMA_LISR_TEIF0) != 0)
	{
		DMA2->LIFCR |= DMA_LISR_TEIF0;
	}

	spi_int++;

	ndtr = spi_mapping[0].rx_dma_stream->NDTR;
	ndtr = DMA_BURST_SIZE - ndtr;
	spi_tx_buffer_cnt += ndtr;

	push_dma_data(&spi_rx_dma_buffer, ndtr);
	spi_mapping[0].rx_dma_stream->M0AR = (uint32_t)spi_rx_dma_buffer.buf[spi_rx_dma_buffer.push];

	// sekim XXXXX
	host_rtos_set_semaphore(&dma_mutex, WICED_TRUE);
	spi_rx_buffer_cnt += ndtr;
	sprintf(szXXXX3, "XXX 200 : (%d, %d)\r\n", (int)spi_int, (int)spi_rx_buffer_cnt);
	strcat(szXXXX2, szXXXX3);


	DMA_Cmd(spi_mapping[0].rx_dma_stream, ENABLE);
#endif	// 2013.12.09 sskim
}

void spi1_tx_dma_irq(void)
{
	if((DMA2->HISR & DMA_HISR_TCIF5) != 0)
	{
		DMA2->HIFCR |= DMA_HISR_TCIF5; 
	}

	if((DMA2->HISR & DMA_HISR_TEIF5) != 0)
	{
		DMA2->HIFCR |= DMA_HISR_TEIF5;
	}
}
#endif	// 2013.12.05 sskim

#ifdef BUILD_WIZFI250	// 2013.12.18 sskim
static uint32_t polling_cnt = 0;
uint32_t poll_event_cnt = 0;
uint32_t pre_dma_data = 0;
void dma_polling_thread_hndlr( uint32_t arg )
{
	static uint32_t pre_dma_data_num = 0xffffffff;
	arg++;

	while(1)
	{
		host_rtos_delay_milliseconds(10);

		if(pre_dma_data_num == spi_mapping[0].rx_dma_stream->NDTR)
		{
			if(pre_dma_data_num != DMA_BURST_SIZE)
				polling_cnt++;

			if(polling_cnt >= 10)
			{
//				spi_test_cnt = spi_tx_buffer_cnt;
				pre_dma_data = pre_dma_data_num;

				DMA_Cmd(spi_mapping[0].rx_dma_stream, DISABLE);	
				polling_cnt = 0;
				pre_dma_data_num = 0xffffffff;
				poll_event_cnt++;
			}
		}
		else
		{
			pre_dma_data_num = spi_mapping[0].rx_dma_stream->NDTR;
		}
	}
}

#define WX_MODE_COMMAND	0
#define WX_MODE_DATA	1
extern uint8_t g_wxModeState;
extern uint8_t WXNetwork_NetTx(uint8_t scid, void *buf, uint32_t len);
void spi_dma_thread_hndlr( uint32_t arg )
{
	uint32_t	i, l_ndtr = 0;
	uint8_t		buf[DMA_BURST_SIZE];
	int 		ret;
	arg++;

	while(1)
	{
		uint32_t free_len;

		host_rtos_get_semaphore(&dma_mutex, WICED_NEVER_TIMEOUT, WICED_TRUE );
		//host_rtos_get_semaphore(&dma_mutex, 10, WICED_TRUE );

		spi_thread_cnt++;

		free_len = ring_buffer_free_space(&stdio_rx_buffer);

		//sprintf(szXXXX3, "(%d, %d)", (int)free_len, (int)spi_rx_suspend);
		//strcat(szXXXX2, szXXXX3);

		if(free_len <= (DMA_BURST_SIZE*2)) {
			if(spi_rx_suspend == CTRL_NON) {	// 'IF' is needed for check that it is not in sending action (CTRL_RDY)
				strcat(szXXXX2, "Q1");
				spi_rx_suspend = CTRL_REQ;
				spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
				if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
			}
			if(free_len == 0) {
				GPIO_ResetBits( GPIOB, (uint16_t) (1 << 6) );
				spi_stdio_drop_cnt++;
				strcat(szXXXX2, "Q2");

				platfrom_spi_stdio_x = 2;
				if((uart_interfaces[0].rx_size > 0) && (ring_buffer_used_space(&stdio_rx_buffer) >= uart_interfaces[0].rx_size))
				{
					strcat(szXXXX2, "Q3");
					host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
					uart_interfaces[0].rx_size = 0;
				}
				continue;
			}
		}

		DMA_ITConfig(spi_mapping[0].rx_dma_stream, DMA_IT_TC | DMA_IT_TE, DISABLE);
		ret = pop_dma_data(&spi_rx_dma_buffer, buf, &l_ndtr);

