Wiznet-OpenHardware/WizFi250_SDK/WICED-SDK-2.4.0/Wiced/Platform/common/ARM_Cortex_M3/STM32F2xx/stm32f2xx_platform(고속, dma에서 XOFF 동작 안함. 문제 해결 중. nodma는 그럭저럭 동작).c
		DMA_ITConfig(spi_mapping[0].rx_dma_stream, DMA_IT_TC | DMA_IT_TE, ENABLE);

		if(ret < 0)
		{
			/* Buffer Underflow */
			continue;
		}

		spi_rx_buffer_cnt += l_ndtr;

		if(g_wxModeState == WX_MODE_DATA)
		{
			static uint32_t xxxx_len = 0;
			xxxx_len += (uint32_t)l_ndtr;
			sprintf(szXXXX3, "XXX 210 : (%lu, %d)\r\n", xxxx_len, (int)l_ndtr);
			strcat(szXXXX2, szXXXX3);

			WXNetwork_NetTx((uint8_t)0, (void *)buf, l_ndtr);
		}
		else
		{
			for(i = 0 ; i < l_ndtr ; i++)
			{
				uint8_t tch = buf[i];
				static uint8_t esc = RESET;
				static uint8_t sync[2] = {SPI_ESC, SPI_SYNC};

				if(tch == SPI_NULL) {
					continue;
				}

				if(tch == SPI_ESC) {
					esc = SET;
					continue;
				} else if(esc == SET) {
					esc = RESET;
					switch(tch) {
					case SPI_F0:	// Pass 'F0' to upper
						tch = 0xF0;
						break;
					case SPI_F1: // Pass 'F1' to upper
						tch = 0xF1;
						break;
					case SPI_SYNC: // Handle Sync Signal
						if(ring_buffer_free_space(&stdio_tx_buffer) >= 2)
							ring_buffer_write(&stdio_tx_buffer, sync, 2);
						continue;
					case SPI_XON: // Handle Xon Signal
						spi_tx_suspend = CTRL_NON;
						continue;
					case SPI_XOFF: // Handle Xoff Signal
						spi_tx_suspend = CTRL_REQ;
						continue;
					case SPI_ERR: // Handle Error Signal
						// ToDo
						continue;
					case SPI_ESC: // Lost ESC Data
						esc = SET;	//Just Ignore previous ESC
						continue;
					default:
						// ToDo
						continue;
					}
					spi_tx_sig_cnt = SPI_GPIO_CLEAR_COUNT;
					if(spi_rx_stop == WICED_FALSE) wiced_gpio_output_high( WIZFI_SPI_REQ );
				}

				ring_buffer_write(&stdio_rx_buffer, &tch, 1);
				//sprintf(szXXXX3, "%c", tch);
				//strcat(szXXXX2, szXXXX3);
				//spi_rx_data_cnt++;

				// sekim 20131125 add platfrom_spi_stdio_x
				platfrom_spi_stdio_x = 2;

				if((uart_interfaces[0].rx_size > 0) && (ring_buffer_used_space(&stdio_rx_buffer) >= uart_interfaces[0].rx_size))
				{
					host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
					uart_interfaces[0].rx_size = 0;
				}
			}
		}

	}
}
#endif

void usart1_irq( void )
{
#if 0 //MikeJ 130528 ID1072 - Improve UART Performance
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART1->SR = (uint16_t) (USART1->SR | 0xffff);

    // Update tail
    uart_interfaces[0].rx_buffer->tail = uart_interfaces[0].rx_buffer->size - uart_mapping[0].rx_dma_stream->NDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[0].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[0].rx_buffer ) >= uart_interfaces[0].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
        uart_interfaces[0].rx_size = 0;
    }
#else
	uint32_t usedlen;

    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART1->SR = (uint16_t) (USART1->SR | 0xffff);

    // Update tail
    uart_interfaces[0].rx_buffer->tail = uart_interfaces[0].rx_buffer->size - uart_mapping[0].rx_dma_stream->NDTR;

#ifdef BUILD_WIZFI250
    // sekim 20131125 add platfrom_spi_stdio_x
    platfrom_spi_stdio_x = 1;
#endif

    // Notify thread if sufficient data are available
	usedlen = ring_buffer_used_space( uart_interfaces[0].rx_buffer );
    if ( ( uart_interfaces[0].rx_size > 0 ) && ( usedlen >= uart_interfaces[0].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
        uart_interfaces[0].rx_size = 0;
    }

	if(usedlen > uart_interfaces[0].rx_buffer->size - 30)
	{
		GPIO_WriteBit(uart_mapping[STDIO_UART].pin_rts->bank,
		(uint16_t) (1 << uart_mapping[WICED_UART_1].pin_rts->number), Bit_SET);
	}
#endif
}

void usart2_irq( void )
{
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART2->SR = (uint16_t) (USART2->SR | 0xffff);

    // Update tail
    uart_interfaces[1].rx_buffer->tail = uart_interfaces[1].rx_buffer->size - uart_mapping[1].rx_dma_stream->NDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[1].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[1].rx_buffer ) >= uart_interfaces[1].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[1].rx_complete, WICED_TRUE );
        uart_interfaces[1].rx_size = 0;
    }
}

void usart6_irq( void )
{
    // Clear all interrupts. It's safe to do so because only RXNE interrupt is enabled
    USART6->SR = (uint16_t) (USART6->SR | 0xffff);

    // Update tail
    uart_interfaces[0].rx_buffer->tail = uart_interfaces[0].rx_buffer->size - uart_mapping[0].rx_dma_stream->NDTR;

    // Notify thread if sufficient data are available
    if ( ( uart_interfaces[0].rx_size > 0 ) && ( ring_buffer_used_space( uart_interfaces[0].rx_buffer ) >= uart_interfaces[0].rx_size ) )
    {
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
        uart_interfaces[0].rx_size = 0;
    }
}

void usart1_tx_dma_irq( void )
{
    if ( ( DMA2 ->HISR & DMA_HISR_TCIF7 ) != 0 )
    {
        DMA2 ->HIFCR |= DMA_HISR_TCIF7;
        host_rtos_set_semaphore( &uart_interfaces[0].tx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( ( DMA2 ->HISR & DMA_HISR_TEIF7 )!= 0 )
    {
        /* Clear interrupt */
        DMA2 ->HIFCR |= DMA_HISR_TEIF7;
    }
}

void usart2_tx_dma_irq( void )
{
    if ( (DMA1->HISR & DMA_HISR_TCIF6) != 0 )
    {
        DMA1->HIFCR |= DMA_HISR_TCIF6;
        host_rtos_set_semaphore( &uart_interfaces[1].tx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( (DMA1->HISR & DMA_HISR_TEIF6) != 0 )
    {
        /* Clear interrupt */
        DMA1->HIFCR |= DMA_HISR_TEIF6;
    }
}

void usart6_tx_dma_irq( void )
{
    if ( (DMA2->HISR & DMA_HISR_TCIF6) != 0 )
    {
        DMA2->HIFCR |= DMA_HISR_TCIF6;
        host_rtos_set_semaphore( &uart_interfaces[0].tx_complete, WICED_TRUE );
    }

    /* TX DMA error */
    if ( (DMA2->HISR & DMA_HISR_TEIF6) != 0 )
    {
        /* Clear interrupt */
        DMA2->HIFCR |= DMA_HISR_TEIF6;
    }
}

void usart1_rx_dma_irq( void )
{
    if ( ( DMA2->LISR & DMA_LISR_TCIF2)  != 0 )
    {
        DMA2->LIFCR |= DMA_LISR_TCIF2;
        host_rtos_set_semaphore( &uart_interfaces[0].rx_complete, WICED_TRUE );
//        DMA2_Stream2 ->NDTR = uart_interfaces[0].rx_buffer->size;
    }

    /* TX DMA error */
    if ( ( DMA2->LISR & DMA_LISR_TEIF2 ) != 0 )
    {
        /* Clear interrupt */
        DMA2->LIFCR |= DMA_LISR_TEIF2;
    }
}

